In [1]:
import pandas as pd

In [2]:
var1 = pd.DataFrame({"a":[1,2,3,4],"b":[11,12,13,14]})
var2 = pd.DataFrame({"c":[10,20,30,40],"d":[11,12,13,14]})

In [3]:
var1.join(var2)

   a   b   c   d
0  1  11  10  11
1  2  12  20  12
2  3  13  30  13
3  4  14  40  14

In [4]:
# we can pass index paramterto chnage index

In [8]:
var3 = pd.DataFrame({"a":[1,2,3,4],"b":[11,12,13,14]},index=["a","b","c","d"])
var4 = pd.DataFrame({"c":[10,20,30,40],"d":[11,12,13,14]})

In [10]:
var3.join(var4)

   a   b   c   d
a  1  11 NaN NaN
b  2  12 NaN NaN
c  3  13 NaN NaN
d  4  14 NaN NaN

In [11]:
var4.join(var3,how="left")

    c   d   a   b
0  10  11 NaN NaN
1  20  12 NaN NaN
2  30  13 NaN NaN
3  40  14 NaN NaN

In [14]:
# now we willuse append function  it is similar to concat

In [13]:
var1.append(var2)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_26832\3050012397.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  var1.append(var2)

     a     b     c     d
0  1.0  11.0   NaN   NaN
1  2.0  12.0   NaN   NaN
2  3.0  13.0   NaN   NaN
3  4.0  14.0   NaN   NaN
0  NaN   NaN  10.0  11.0
1  NaN   NaN  20.0  12.0
2  NaN   NaN  30.0  13.0
3  NaN   NaN  40.0  14.0